{
  "projects": [
    {
      "name": "TokTok",
      "type": "Application web",
      "img": "toktok-nobg.png",
      "description": "Développement d'un réseau social de proximité pour rapprocher les voisins. Comme sur Facebook, on peut y partager des publications, poster des petites annonces et discutez avec ses contacts. Projet de fin de formation réalisé en équipe de 4 en vue de la préparation au Titre pro DWWM",
      "tags": [
        "react",
        "redux",
        "express",
        "sequelize",
        "JWT",
        "Material Ui",
        "aws"
      ],
      "github": "https://github.com/O-clock-Uranium/projet-tok-tok-back",
      "website": "https://tok-tok-front.onrender.com/"
    },
    {
      "name": "FitnessBuddy",
      "type": "Application web",
      "img": "fitnessbuddy-nobg.png",
      "description": "Application de suivi de séances de sport. Permet de garder en mémoire les exercices de chaque séance avec le nombre de répétitions et la charge ainsi qu'un chronomètre. Evolution: transformation en app mobile avec React Native",
      "tags": ["react", "sass", "express", "sequelize", "JWT", "postgresql"],
      "github": "https://github.com/chloebatillet/fitness-buddy",
      "website": "https://fitness-buddy-xi.vercel.app/"
    },
    {
      "name": "Portfolio",
      "type": "Site web",
      "img": "portfolio-nobg.png",
      "description": "Site de présentation de mon parcours et de mes projets. C'est mon terrain de jeu pour expériementer les animations à l'aide de GSAP. Pas vraiment besoin de plus le décrire !",
      "tags": ["react", "sass", "gsap", "framer.motion", "emailjs"],
      "github": "https://github.com/chloebatillet/portfolio-website",
      "website": "https://www.chloebatillet.com/"
    },
    {
      "name": "BeGuide",
      "type": "Extension web",
      "img": "beguide-nobg.png",
      "description": "Participation au développement d'un outil interne de suivi de mini-formation, dans le même style que Udemy. L'application possède deux interfaces : une extension web pour les visiteurs et une site pour les administrateurs.",
      "tags": ["react", "redux", "phpmyadmin", "mysql", "appsmith", "laravel"],
      "github": "",
      "website": ""
    },
    {
      "name": "ElevateX",
      "type": "Site e-commerce",
      "img": "elevatex-nobg.png",
      "description": "Boutique en ligne de baskets futuristes. Filtrage des produits, intégration du paiement avec L'API Stripe et recherche de magasins sur une carte interactive. Je travaille actuellement sur un backend pour gérer les stocks et les commandes (node/express/drizzle).",
      "tags": ["react", "redux", "nextUI", "tailwind", "stripe", "leaflet"],
      "github": "https://github.com/chloebatillet/elevateX-shop",
      "website": "https://elevate-x-shop.vercel.app/"
    }
  ],
  "experiences": [
    {
      "title": "Diplôme DWWM",
      "dates": "dec 2023",
      "company": "O'Clock",
      "details": "Après une formation de 6 mois orientée Javascript/Node.js puis une spécialisation React, j'ai validé les parties front et back de l'examen Développeur Web et Web Mobile !"
    },
    {
      "title": "Stage Développeur React",
      "dates": "oct 2023 - dec 2023",
      "company": "Fedhubs",
      "details": "Développement d'un outil interne de formations avec une partie backoffice et une partie client sous la forme d'une extension chrome."
    },
    {
      "title": "Master Management - Innovation",
      "dates": "sept 2022",
      "company": "IAE Clermont Auvergne",
      "details": "Master axé notamment sur la gestion de projets avec une expertise approfondie des méthodes agiles telles que Scrum, renforçant ainsi mes compétences dans la conduite efficace de projets innovants."
    },
    {
      "title": "Chargée de communication digitale",
      "dates": "avr 2020 - sept 2022",
      "company": "Michelin",
      "details": "Création, optimisation et gestion d'intranets, suivi des KPI, gestion de projet, confection de vidéos et de supports intéractifs, rédaction d'articles et diffusion de newsletters."
    },
    {
      "title": "Stage en communication digitale",
      "dates": "sept 2022",
      "company": "La Charrette Créole",
      "details": "Création & optimisation SEO d'un site vitrine Wordpress, rédaction de contenu, communication, élaboration d'une stratégie pour les réseaux sociaux."
    }
  ],
  "about": {
    "presentation" : "Passionnée de logique depuis toujours, j'ai choisi le développement web. J'y ai trouvé ce que je cherchais : un moyen de satisfaire ma curiosité, beaucoup de créativité et surtout des heures à me creuser la tête ! Aujourd'hui, je recherche à approfondir mes connaissances avant d’intégrer une entreprise qui sera prête à m’accompagner dans cette nouvelle carrière ☺",
    "techno": ["html", "css/scss", "tailwind", "javascript ES6+", "typescript", "react", "redux", "axios", "API REST", "node.js", "sql", "sequelize"],
    "tools": ["git/github", "vercel/netlify/render", "insomnia", "appsmith", "figma", "notion"]
  }
}
